Tekla Open API Reference for Tekla Structures 2025
LoadArea.Insert Method
 Inserts the load area into the model database.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Insert()
Public Overrides Function Insert As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
LoadArea Class
Tekla.Structures.Model Namespace